schreibfaul1/ESP32-MiniWebRadio/src/common.h
    void updateBitRate(uint32_t bitRate){
        m_bitRate = bitRate;
        char sbr[10];
        itoa(bitRate, sbr, 10);
        if(m_bitRate < 1000) { strcat(sbr, "K"); }
        else {
            sbr[2] = sbr[1];
            sbr[1] = '.';
            sbr[3] = 'M';
            sbr[4] = '\0';
        }
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_bitRateColor);
        tft.fillRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bgColor);
        uint8_t space = 2;
        if(strlen(sbr) < 4) space += 5;
        tft.writeText(sbr, m_bitRate_x + space, m_y, m_bitRate_w, m_h, TFT_ALIGN_CENTER);
        xSemaphoreGive(mutex_display);
    }
    void setBitRateColor(uint16_t bitRateColor){
        m_bitRateColor = bitRateColor;
    }
    void setIpAddr(const char* ipAddr){
        if(m_ipAddr){free(m_ipAddr); m_ipAddr = NULL;}
        m_ipAddr = strdup(ipAddr);
        char myIP[30] = "IP:";
        strcpy(myIP + 3, ipAddr);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_ipAddrColor);
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.fillRect(m_ipAddr_x, m_y, m_ipAddr_w, m_h, m_bgColor);
        tft.writeText(myIP, m_ipAddr_x, m_y, m_ipAddr_w, m_h, TFT_ALIGN_RIGHT, true);
        xSemaphoreGive(mutex_display);
    }
    void setIpAddrColor(uint16_t ipAddrColor){
        m_ipAddrColor = ipAddrColor;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
